Revit 2024 API
RebarShapeConstraintCircumference Properties
The RebarShapeConstraintCircumference type exposes the following members.
Properties
Name | Description
ArcReferenceType
 The choice of rule for measuring the diameter.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraintCircumference Class
Autodesk.Revit.DB.Structure Namespace